[
	{
		"title": "Start",
		"tags": "",
		"body": "<<activateSpeechBubble Brynn>>\r\n[Rebranch]\r\nBrynn: You find a staircase that leads up into the higher parts of the castle.\r\nAllison: Okay, it seems a little too quiet, but I guess we’ll just have to be careful. I go up the stairs.\r\nLance: I follow.\r\nRuby: Me too.\r\nFranklin: Same.\r\nBrynn: The staircase ends at a strange room, about midway up the castle. It’s wide, tall and curiously empty.\r\nAllison: Uh-oh… \r\nBrynn: Then, you hear a man let out a familiar maniacal cackle… \r\nBrynn (in-character): He-he-hee! A pleasure to see you again, “heroes!”\r\nBrynn (in-character): Lady Malacatha is in the middle of important business at the moment, but I’m more than happy to keep you… <i>entertained</i>.\r\nLance: Holy shit, it’s <i>Narravar</i>!\r\nBrynn (happy): Sure is!\r\nBrynn: A man wearing black robes embedded with glowing runes steps out of the exit on the other side of the room. He removes his hood and looks right at you, Lance.\r\nBrynn (in-character): Ah, Shadowfall! I didn’t expect to see you again so soon after our last encounter! Are you prepared to lose another of your loved ones?\r\nLance (happy) [Bark: Positive]: <i>Yes!</i> I had a feeling he would come back at some point!\r\nLance (in-character) (irritated): So we meet again, Bone Weaver! In memory of my father, I swear I’ll put you down!\r\nAllison: Wait a sec, I roll perception on the room.\r\nBrynn: Go for it.\r\n[Allison D20 Roll]\r\nAllison: 18.\r\nBrynn: Being Tiana, you get the feeling something’s definitely off. This room isn’t built like the other ones you’ve gone through, as every surface of it is covered entirely in metal.\r\nBrynn: And up above, you notice what look like swirling thunderclouds <i>inside</i> the room, just beneath the ceiling.\r\nAllison: Oh, Jesus. What?\r\nBrynn: At that moment, Narravar touches his hand to the crystal amulet around his neck, and each exit is sealed by columns of transparent crystal.\r\nBrynn: A column of crystal also erupts from the ground below him, raising him above the metal floor.\r\nAllison (in-character): Everyone, the room is set up to conduct lightning from that magical storm up above. He’s probably going to finish summoning it, then…\r\nAllison (happy): Wait, hang on! \r\nAllison: I cast Telepathic Bond on all four of us.\r\nBrynn: Sounds good. What do you say, or think, to everyone?\r\nAllison (in-character): Alright, so the spell Narravar used to conjure that storm probably doesn’t target its caster… \r\nAllison (in-character): … but we can use something metal to conduct the electricity and force it back towards him. Essentially, we trap him in his own trap.\r\nRuby (in-character): Ah! Okay.\r\nFranklin (in-character): Interesting.\r\nAllison (in-character): We’ll need to stall him, so I can find something in here that we can use to entrap him.\r\nAllison (in-character): Keep him talking, and I’ll look around for—\r\n[Interruption]\r\nLance (in-character): <i>Narravar!</i>\r\nLance (in-character): I challenge you to a duel!\r\nAllison (irritated) [Bark: Negative]: Oh, God…\r\nLance (irritated) (in-character): Just you and I, Narravar. This is between us.\r\nAllison: Okay, I telepathically accost Lance.\r\nAllison (in-character): Arannis, stop! If you engage him, we’ll lose the element of surprise.\r\nLance (in-character): Suits me fine. I promised my father that I would use his sword to slay Narravar, and that’s one promise Arannis Shadowfall intends to keep.\r\nAllison (in-character): Oh, it suits <i>you?</i> What about everyone else, who can’t afford to lose health before facing Malacatha?\r\nLance: (Yeah, sure. And what about me waiting months for my backstory quest to be wrapped up?)\r\n",
		"position": {
			"x": 532,
			"y": 221
		},
		"colorID": 0
	}
]