[
	{
		"title": "Start",
		"tags": "",
		"body": "<<activateSpeechBubble Brynn>>\n— - — - — - — - … ... … ... … ...\nBrynn: Anyway, Vel, you can discern that this anti-magic field seems to emanate from the castle itself. You doubt you’ll be able to teleport very far within its walls. You think you can at least get everyone to the wall itself, though.\nRuby: Oh, yikes. I do so, then report all of this to the party.\nAllison (in-character): Well, <i>that</i> complicates things. Vel, do you think you could try again?\nRuby: I don’t know, I don’t think so. I’d probably need to roll at least a 19 to—\n[Interruption]\nRuby (in-character): Err… I mean, her anti-magic is probably too strong for my spells to overcome!\nFranklin (in-character): Damn. So we can’t teleport in, and we probably can’t smash our way in, either.\nLance (in-character): Hardly a problem when Arannis Shadowfall is at your side! Stand back, everyone.\nAllison: [Bark: negative/sigh] *Sigh* Oh, God…\nLance: Alright, so I stretch my arms and legs, then run straight at the castle wall—\n[Interruption]\nAllison (irritated): Yeeeah, no. Brynn, I stop him. I block his path.\nLance (irritated): Wh—? <i>*Sigh*</i>\nAllison (in-character) [Bark: “What are you doing?” if we have it]: Arannis, what are you doing?\nLance (in-character): Why, no less than saving the mission, <i>Tiana</i>. You know how agile I am. I can vault up the side of the wall and then tie a rope for you all to climb up.\nAllison (in-character): It’s the enemy’s fortress! There could be undead guards up there; they’d attack you immediately.\nLance (happy) (in-character): They’d try.\nLance: And then Arannis winks, and cracks his knuckles.\nAllison: Oh, for the love of…\nAllison (in-character): No. That could completely ruin our chances of getting in undetected. Don’t be an idiot, Arannis.\nLance (irritated) (in-character): Okay look, miss know-it-all, I realize that ever since you got us out of that snake pit you’ve fancied yourself as some great tactician, but right now my skills are all you need. Aren’t I right, everyone?\nAllison (in-character): Oh, your <i>“skills?”</i> The ones that got us trapped in that snake pit in the first place? I don’t think so. We work as a team, or we don’t work at all.\nLance (irritated) (in-character): Well, what do <i>you</i> propose, then, fearless leader?\nRuby (awkward/uncomfortable): Wow, this roleplaying is… uh… pretty good!\nFranklin (irritated): Sure is...\nFranklin (in-character): Are we getting in the castle, or not?\nAllison (in-character): We will, once <i>Arannis</i> decides to stand down and we find a more intelligent way to proceed.\nLance (in-character): This is a fortified castle! What other way could there possibly be to get in?\n",
		"position": {
			"x": 532,
			"y": 221
		},
		"colorID": 0
	}
]