[
	{
		"title": "Start",
		"tags": "",
		"body": "<<activateSpeechBubble Ruby>><<overridePose Ruby plusTwo>>Yes!\r\n<<activateSpeechBubble Franklin>><<overridePose Franklin plusOne>>Sure.\r\n<<activateSpeechBubble Allison>><<overridePose Allison plusOne>>Okay, let’s do it.\r\n<<activateSpeechBubble Lance>>Alright, let’s go already!\r\n<<activateSpeechBubble Lance>><<changeFont Lance inCharacter>>Arannis’ thirst for adventure will not be sated!<<changeFont Lance outOfCharacter>>\r\n<<activateSpeechBubble Brynn>>Alright, then.\r\n<<returnToDefaultPose Brynn>>\r\n<<returnToDefaultPose Lance>>\r\n<<returnToDefaultPose Allison>>\r\n<<returnToDefaultPose Ruby>>\r\n<<returnToDefaultPose Franklin>>\r\n<<activateSpeechBubble Brynn>>When last we saw our heroes, the great adventurers of lore, they were continuing their quest to defeat Lady Malacatha and end her reign of tyranny.\r\n<<activateSpeechBubble Brynn>>The heroes had been fighting her for a long, long time. They’d met many friends along the way, some of them brave warriors, some of them ordinary townsfolk…\r\n<<activateSpeechBubble Lance>>Never forget Larry the bagel shop owner, whose shop we destroyed.\r\n<<activateSpeechBubble Brynn>>…Yes, even a merchant selling bagels, despite the fact that bagels didn’t exist in medieval times. Truly, he will never stop being angry about his shop burning down.\r\n<<activateSpeechBubble Ruby>>I’m still really sorry about that!\r\n<<activateSpeechBubble Brynn>>And now, inspired by the heroes, these friends and comrades have begun an assault on Lady Malacatha’s citadel.\r\n<<activateSpeechBubble Brynn>>If all goes well, the group will finally complete the mission they’ve had for so long.\r\n<<activateSpeechBubble Lance>>Okay, so where exactly are we again? We’re near Lady Malacatha’s citadel now, right?\r\n<<activateSpeechBubble Brynn>>Right. You guys are a little ways off to the east of Malacatha’s castle. Currently you’re hiding behind some of the pointed rocks which litter the jagged terrain surrounding it. \r\n<<activateSpeechBubble Brynn>>Peeking out from your hiding spots, you’re able to see the castle straight ahead of you in all its glooming, gothic majesty. \r\n<<activateSpeechBubble Brynn>>To the south, in front of the castle’s main gates, you can see the armies of the Fullcrest alliance that you helped create charging toward a huge gathering of undead monsters guarding the castle.\r\n<<activateSpeechBubble Allison>>How many is a “huge gathering”? \r\n<<activateSpeechBubble Brynn>>Well from where you’re at you don’t have the best view of the undead army \r\n<<activateSpeechBubble Brynn>>but it looks roughly similar in size to the Fullcrest alliance’s which you know to be about 3,000 fighters strong.\r\n<<activateSpeechBubble Allison>>Similar in size? Yeesh, is Malacatha controlling them all herself? That’s insane.\r\n<<activateSpeechBubble Lance>>Yeah and that’s just the ones we can see. No way there’s not more still still inside.\r\n<<activateSpeechBubble Ruby>>I hope all of friends will be okay. They’re all super powerful but still...that’s so many for them to have to fight.\r\n<<activateSpeechBubble Franklin>>Well, the sooner we reach Malacatha and stop her the better their chances will be. We’ve gotta start moving.\r\n<<activateSpeechBubble Lance>>Exactly what I was going to say. Vel, would you be a dear and start the teleportation spell?\r\n<<activateSpeechBubble Ruby>>…\r\n<<activateSpeechBubble Ruby>>Oh, Vel! That’s me, right! Sorry, it has been a while since I’ve played her, you know?\r\n<<activateSpeechBubble Allison>>Don’t you worry about it Ruby, we’ve all gotta get back into the groove of things I’m sure. Right Byren?\r\n<<activateSpeechBubble Franklin>>Yes um...Tiana.\r\n<<activateSpeechBubble Allison>>See? He had to think about my name.\r\n<<activateSpeechBubble Lance>>Hey guys, you know I love me some tangents but I’m pretty sure we’re on the clock here if Brynn is being her usual self.\r\n<<activateSpeechBubble Brynn>>What? Noooo, you guys should definitely talk as much as you want while the two armies have already begun clashing.\r\n<<activateSpeechBubble Lance>>See? Definitely time to move. Vel, you ready?\r\n<<activateSpeechBubble Ruby>>Yup! One group teleportation coming right up! I’m aiming straight for the throne room right?\r\n<<activateSpeechBubble Lance>>You know it, preferably right on top of Malacatha’s stupid face if you would.\r\n<<activateSpeechBubble Allison>>Uh you should definitely ignore that, but yes the throne room’s where she should be. We pop in, take her out, her power stops flowing through the undead causing them to stop existing and then we win.\r\n<<activateSpeechBubble Ruby>>Right...it’s all over just like that.\r\n<<activateSpeechBubble Lance>>Exactly, just like that. Besides, it’ll be even easier than that with me, the legendary rogue, Arranis Shadowfall at your side!\r\n<<activateSpeechBubble Allison>>Vel please teleport us before he starts monologuing.\r\n<<activateSpeechBubble Lance>>Monologuing? Hey, I don’t m-\r\n<<activateSpeechBubble Ruby>>I cast mass teleport!\r\n<<activateSpeechBubble Brynn>>Okay, okay, so as you begin casting mass teleport, I’m going to need you to make a Wisdom check.\r\n<<activateSpeechBubble Ruby>>A Wisdom check? That’s...new. Okay um…\r\n<<activateSpeechBubble Ruby>>18.\r\n<<activateSpeechBubble Brynn>>18? Sorry but as you begin casting mass teleport you begin to feel the influence of something emanating from the direction of the castle, filling your mind with overwhelming pain.\r\n<<activateSpeechBubble Brynn>>From the shock of the sudden pain you drop the spell and the effect fades from you, although you do take…\r\n<<activateSpeechBubble Brynn>>36 points of psychic damage as your head is still pounding from what just happened.\r\n<<activateSpeechBubble Lance>>What the-\r\n<<activateSpeechBubble Allison>>Vel! Vel what happened? Are you okay?\r\n<<activateSpeechBubble Ruby>>I’m fine, I’m fine. It’s just...ow...my head hurts. \r\n<<activateSpeechBubble Ruby>>Something...or someone in the castle was stopping me from finishing the teleport.\r\n<<activateSpeechBubble Franklin>>Well that sucks.\r\n<<activateSpeechBubble Lance>>Yeah no kidding. Any chance you could try again?\r\n<<activateSpeechBubble Ruby>>I don’t know, I don’t think it’d work. I got an 18 on that check and I still failed it, the DC must be really high.\r\n<<activateSpeechBubble Ruby>>Plus, that hurt a LOT. Speaking of which, I’m going to heal myself.\r\n<<activateSpeechBubble Ruby>>Brynn do I have to make a check for that?\r\n<<activateSpeechBubble Brynn>>Nope, your healing spell goes through without a repeat of that interference.\r\n<<activateSpeechBubble Allison>>Interesting…\r\n<<activateSpeechBubble Lance>>Looks like we’ve gotta get in the old fashioned way then. Just leave it all to me guys. Arranis has got this.\r\n<<activateSpeechBubble Allison>>Arranis, baby, PLEASE don’t go off on one of your suicidal solo missions right now.\r\n<<activateSpeechBubble Lance>>They’re not suicidal if I’ve never failed a single one though.\r\n<<activateSpeechBubble Allison>>Yeah, but that’s because you’re lucky and for no other reason.\r\n<<activateSpeechBubble Allison>>Regardless of however we get in, we should go in together, like a team. Because, you know, we are one.\r\n<<activateSpeechBubble Lance>>But me going in and doing my thing IS for the team.\r\n<<activateSpeechBubble Lance>>Listen to this, it’s really simple.\r\n<<activateSpeechBubble Lance>>I scale the wall with my ninja skills, quickly and quietly take out anyone who might be on top of the wall, and once the coast is clear I tie a rope to the top and toss it down so you guys can climb up.\r\n<<activateSpeechBubble Lance>>I’m telling ya, it’s a fool proof three step plan!\r\n<<activateSpeechBubble Allison>>Right, definitely no way anyone notices that all happening. \r\n<<activateSpeechBubble Allison>>How about instead of that, we just tunnel under the wall with Vel’s power.\r\n<<activateSpeechBubble Ruby>>Oh, I could do that. But we’d have to get closer though, that spell doesn’t last for very long.\r\n<<activateSpeechBubble Allison>>So I’ll make fog so that we don’t get seen approaching the wall and once we’re next to it, Vel will tunnel us underneath until we reach the closest part of the castle.\r\n<<activateSpeechBubble Allison>>From the plans we saw, the nearest room of the castle should only be about 50 feet from the edge of the wall. We tunnel under it, then we all burst up into it and take out anyone in it before they have a chance to alert anyone!\r\n<<activateSpeechBubble Ruby>>That sounds like it could really work!\r\n<<activateSpeechBubble Lance>>Yeah but it’s way more complicated then just getting onto the wall. Besides, we have no idea what or who is in that room but you want to just rush into it?\r\n<<activateSpeechBubble Allison>>As a team? Yup, I do. Besides, can’t be much riskier than leaving the fate of this mission entirely up to you. If you get seen once it’s all over now. We don’t have teleportation as an option anymore.\r\n",
		"position": {
			"x": 532,
			"y": 221
		},
		"colorID": 0
	}
]