[
	{
		"title": "Start",
		"tags": "",
		"body": "“I’ll be right back with the food!”\r\nWithout waiting for all their affirmations, I turn the corner with a light jog and head towards the kitchen.\r\nThe counters were lined with party snacks and hand foods, all the stuff I’d gotten prepared just before everyone had arrived.\r\nI can’t believe how long its been since we’ve all been together! I knew going away for college would make seeing them more difficult but I didn’t think I’d have to wait until the end of the semester to come back…\r\n->Gotta say, it's good we're all together again.\r\n->I hope this isn't too awkward.\r\nGrabbing a large tray from under the sink, I start placing as much of the food onto it as I can.\r\nWell, at least it seems that nothing terrible has happened since I’ve left. Probably because college has been keeping them as busy as its been keeping me.\r\nEveryone except Lance anyway, since he opted not to go so he could focus on making music. I wonder if he and Allison are still trying to start that band together?\r\n->Their sound was pretty good.\r\n->I wonder if they've been able to stay in touch about it.\r\nI know it’s been a bit of a pipe dream of theirs for a while, but maybe after all this time they’ve finally started putting that plan into motion?\r\nIf there was ever anyone who was going to try starting a band while they were already going to college AND traveling the world, Allison’s probably the only person crazy enough to try it.\r\nShe’s always been pretty confident about her multi-tasking superpower, but even that kind of workload might be a bit much for her.\r\n->Aah, she can probably handle it.\r\n->Hope she isn't pushing herself too hard.\r\nOh God, and speaking of workloads I can’t believe Franklin has ANOTHER job. How many is he juggling now? I’ll never know how he finds time to do any of his coursework, or sleep for that matter.\r\nWhat does Ruby think about it? I mean, maybe they’ve been dating for so long that she’s used to it by now?\r\nAlthough I’m sure she’s been busy as well, learning how to be a forensic scientist and all. It’s been a dream of hers since I’ve known her, I wonder how she’s officially working towards it?\r\n->I wonder how those classes are going.\r\n->I wonder if she decided to stick with it.\r\nLifting up the stacked tray, I carefully started heading back to the table I’d sat my friends at. No point thinking about these questions all by myself when I could ask them, right?\r\n",
		"position": {
			"x": 528,
			"y": 218
		},
		"colorID": 0
	},
	{
		"title": "Node2",
		"tags": "",
		"body": "As we stepped inside, I put a hand on Lance's shoulder, discretely holding him back.\n\"Hey, Lance, are you okay?\"\nLance: \"Well, it's...\"\nHe sighs.\nLance: \"I haven't been getting any gigs.\"\nLance: \"All I have is my job at the drugstore. That's it.\"\nLance: \"The band... that was my ticket. That's how I was going to make it big.\"\nLance: \"And Allison... she hasn't been talking to me.\nLance: \"I'm not sure if she still wants to do it. And if she doesn't, where does that leave me?\"\nHe shook his head and turned back into the house. TO BE CONTINUED...",
		"position": {
			"x": 976,
			"y": 97
		},
		"colorID": 0
	},
	{
		"title": "Node3",
		"tags": "",
		"body": "As we stepped inside, I put a hand on Allison's shoulder, discretely holding her back.\n\"Hey, Allison, are you okay? You seemed kind of tense.\"\nAllison: \"It's... well, he's, y'know.\"\nAllison: \"Listen, Ty, I appreciate you getting us back together. This is good.\"\nAllison: \"But the fact is, I've got my own life now. There are things I just can't do here.\"\nAllison: \"But Lance has really been nagging me about that band, and, well...\"\nAllison: \"I don't want to stay in this town. What would my future be if I was stuck here in his band?\"\nShe turned away and went back into the house. TO BE CONTINUED...",
		"position": {
			"x": 975,
			"y": 400
		},
		"colorID": 0
	}
]