[
	{
		"title": "StartLOOL",
		"tags": "",
		"body": "“I’ll be right back with the food!”\nWithout waiting for all their affirmations, I turn the corner with a light jog and head towards the kitchen.\nThe counters were lined with party snacks and hand foods, all the stuff I’d gotten prepared just before everyone had arrived.\nI can’t believe how long its been since we’ve all been together! I knew going away for college would make seeing them more difficult but I didn’t think I’d have to wait until the end of the semester to come back…\n->Gotta say, it's good we're all together again.\n->I hope this isn't too awkward.\nGrabbing a large tray from under the sink, I start placing as much of the food onto it as I can.\nWell, at least it seems that nothing terrible has happened since I’ve left. Probably because college has been keeping them as busy as its been keeping me.\nEveryone except Lance anyway, since he opted not to go so he could focus on making music. I wonder if he and Allison are still trying to start that band together?\n->Their sound was pretty good.\n->I wonder if they've been able to stay in touch about it.\nI know it’s been a bit of a pipe dream of theirs for a while, but maybe after all this time they’ve finally started putting that plan into motion?\nIf there was ever anyone who was going to try starting a band while they were already going to college AND traveling the world, Allison’s probably the only person crazy enough to try it.\nShe’s always been pretty confident about her multi-tasking superpower, but even that kind of workload might be a bit much for her.\n->Aah, she can probably handle it.\n->Hope she isn't pushing herself too hard.\nOh God, and speaking of workloads I can’t believe Franklin has ANOTHER job. How many is he juggling now? I’ll never know how he finds time to do any of his coursework, or sleep for that matter.\nWhat does Ruby think about it? I mean, maybe they’ve been dating for so long that she’s used to it by now?\nAlthough I’m sure she’s been busy as well, learning how to be a forensic scientist and all. It’s been a dream of hers since I’ve known her, I wonder how she’s officially working towards it?\n->I wonder how those classes are going.\n->I wonder if she decided to stick with it.\nLifting up the stacked tray, I carefully started heading back to the table I’d sat my friends at. No point thinking about these questions all by myself when I could ask them, right?\n[[FirstConversation]]",
		"position": {
			"x": 132,
			"y": 209
		},
		"colorID": 0
	},
	{
		"title": "FirstConversation",
		"tags": "",
		"body": "When I got back with a plate of food, things were... interesting.\nIt was quiet, tense really.\nThere was a discussion going on, but not everyone was involved.\n\n<<activateHappyPortrait Ruby>>\n\"That's so cool, Allison!\"\n<<clearPortrait Ruby>>\n\n<<activateNeutralPortrait Allison>>\n\"Yeah, thanks!\"\n\"I'm just glad the career plan is coming together.\"\n\"I never thought music would require so much travel!\"\n\"Well, ah, not this early in my career I mean.\"\n<<clearPortrait Allison>>\n\nThen, Lance spoke up.\n\n<<activateNeutralPortrait Lance>>\n\"Yeah, well, the local scene is where it's at, right?\"\n\"That's where all the fun is! You know what I mean? Here's where all the cool bands are!\"\n<<clearPortrait Lance>>\n\n<<activateNeutralPortrait Allison>>\n\"Eh, those are mainly high school bands.\"\n<<clearPortrait Allison>>\n\n-> \"What's going on?\"\n    <<activateHappyPortrait Ruby>>\n    \"We were just talking about how Allison's doing at music school!\"\n    <<clearPortrait Ruby>>\n    <<activateNeutralPortrait Allison>>\n    \"Yep. At school, outside of school, studying abroad... you name it.\"\n    <<clearPortrait Allison>>\n    [[ChipsAndNostalgia]]\n-> \"Is this Allison-music-career talk?\"\n    <<activateHappyPortrait Allison>>\n    \"Sure is.\"\n    <<clearPortrait Allison>>\n    <<activateHappyPortrait Ruby>>\n    \"Yep! All those dreams are coming true!\"\n    <<clearPortrait Ruby>>\n    <<activateHappyPortrait Allison>>\n    \"Heh, well, I'm trying.\"\n    <<clearPortrait Allison>>\n    <<activateSadPortrait Lance>>\n    \"Yeah. Yeah, man, go get those dreams and everything.\"\n    <<clearPortrait Lance>>\n    Lance sat back and stared at the table.\n    [[ChipsAndNostalgia]]\n-> \"Here, food for the masses!\"\n    [[ChipsAndNostalgia]]\n    \n    ",
		"position": {
			"x": 483,
			"y": 206
		},
		"colorID": 0
	},
	{
		"title": "Start",
		"tags": "",
		"body": "I set down the tray and everyone started taking chips.\n\n<<activateHappyPortrait Ruby>>\n\"Thanks, Ty!\"\n<<clearPortrait Ruby>>\n\n<<activateHappyPortrait Allison>>\n\"Yeah, thanks for having us, too.\"\n<<clearPortrait Allison>>\n\n<<activateNeutralPortrait Franklin>>\n\"Appreciate it, man.\"\n<<clearPortrait Franklin>>\n\n\nPeople's hands collided every now and again over the small bowls of guac. Probably my fault, there. \n\n<<activateNeutralPortrait Lance>>\n\"The local scene is where all the energy is!\"\n\"Seriously, you all remember that concert we went to, right? The one with The Mitokondrias?\"\n<<clearPortrait Lance>>\n\nEveryone seemed to lean back a little. There was a lot of nostalgia from that night, and all different kinds of it.\n\n<<activateHappyPortrait Ruby>>\n\"Oh my God, that's right!\"\n<<clearPortrait Ruby>>\n\n<<activateHappyPortrait Franklin>>\n\"Oh man, throwback.\"\n<<clearPortrait Franklin>>\n\n<<activateHappyPortrait Allison>>\n\"Yeah, okay. They were pretty cool.\"\n<<clearPortrait Allison>>\n\n<<activateNeutralPortrait Lance>>\n\"See? That's what I'm saying!\"\n<<clearPortrait Lance>>\n\nThere's some kind of strain in Lance's voice. I didn't think I'd ever heard him sound like that before.\n\n<<activateSadPortrait Lance>>\n\"I'm focusing on doing my music stuff here. It's... it's not halfway across the world, you know?\"\n<<clearPortrait Lance>>\n\nHe gestured towards Allison, and presumably the rest of the world, where the \"scenes\" she'd visited were located.\nAllison tensed a little.\n\n->\"That makes sense to me, Lance.\"\n    <<increaseValue Lance>>\n    <<decreaseValue Allison>>\n    Lance lit up a little.\n    <<activateHappyPortrait Lance>>\n    \"Yeah? You think so?\"\n    <<activateNeutralPortrait Lance>>\n    \"Well, it'd better be. I'm betting my future on building my guitar career with local club gigs.\n    <<clearPortrait Lance>>    \n    <<revealValue Lance>>\n    Something about the way he was talking... I could tell it really meant a lot to him.\n    Allison, though...\n    <<activateAngryPortrait Allison>>\n    \"I'm not staying anywhere like this. I'd rather not be tied down.\"\n    <<clearPortrait Allison>>\n    <<revealValue Allison>>\n    That's what meant a lot to her. Those seemed like two different things, though. Where was all of the tension coming from?\n    Lance: \"Well, I think being here is nice. And if I can succeed here, then why leave?\"\n    He gestures around the table.\n    Lance: \"Besides, I have all these friends who've gone every which way.\"\n    ->\"Yeah, what has everyone been up to since they left?\"\n        [[SecondDiscussion]]\n-> \"You can't stay tied to one place, right, Allison?\"\n    <<increaseValue Allison>>\n    <<decreaseValue Lance>>\n    Allison nods up and down.\n    <<activateHappyPortrait Allison>>\n    \"Yeah. Yes. Exactly. This place isn't all there is. I have to get out and breathe.\"\n    <<clearPortrait Allison>>\n    <<revealValue Allison>>\n    The way she was talking, and nodding... this obviously meant a lot to her.\n    Lance, though...\n    <<activateSadPortrait Lance>>\n    \"But once you leave, will you ever come back?\"\n    \"What if something's going on back home, and you can't be there?\"\n    <<clearPortrait Lance>>\n    <<revealValue Lance>>\n    Lance looked anxious, doubtful. But what would that have to do with Allison? Why the tension?\n    Allison: \"Well... I don't know what I'd do then. But everyone else is out and about, right?\"\n    -> \"Yeah, what's everyone been up to?\"\n        [[SecondDiscussion]]\n-> \"Maybe we should talk about something else.\"\n    <<activateNeutralPortrait Allison>>\n    \"Fair enough.\"\n    <<clearPortrait Allison>>\n    <<activateNeutralPortrait Lance>>\n    \"Ty, we saw a few of the music acts around here in high school. Back me up on this!\"\n    <<clearPortrait Lance>>\n    <<activateNeutralPortrait Allison>>\n    \"Come on, don't badger him.\" \n    \"Honestly, it's just as much an independence thing, anyway. I like it here, but I'd rather be checking out new places, you know?\"\n    <<clearPortrait Allison>>\n    <<revealValue Allison>>\n    She always had been more independent. Or at least wanted to be. She was never aloof, but I'd always gotten the sense she wanted to go in her own direction.\n    <<activateNeutralPortrait Lance>>\n    \"But you're leaving behind so much! What are the rest of us supposed to do?\"\n    <<clearPortrait Lance>>\n    <<revealValue Lance>>\n    Lance had dreams he was shooting for, too, but for him those seemed more like a source of anxiety than anything.\n    Allison: \"'Supposed to...'? What do you mean? You can do whatever you want.\"\n    ->\"Uh, right! In fact, what has everyone been up to?\"\n        [[SecondDiscussion]]\n    ->\"Yeah, Lance, you work, right?\"\n        Lance: \"It's about more than getting paid, man, it's about... I don't know.\" \n        Lance: \"Okay, sure, let's talk about something else. What's everyone else been doing?\"\n        [[SecondDiscussion]]",
		"position": {
			"x": 803,
			"y": 210
		},
		"colorID": 0
	},
	{
		"title": "SecondDiscussionOldCopy",
		"tags": "Old_Draft",
		"body": "Ruby: \"Yeah, I was just asking! It's been so long since we talked.\"\nRuby: \"I feel like we've been out of touch for too long. It just feels weird. I've missed this, honestly.\"\n<<revealRubyValue Ruby>>\nRuby always was the one to listen to everyone else's problems, to be there for them when they opened up. I hadn't realized how much she'd valued that.\nRuby: \"Anyway, as for me, the whole forensic science thing is still going strong.\"\nAllison: \"So, how's Washington?\"\nRuby: \"Oh, man, it's so cool! I mean it gets a little weird there with all the protests that happen, but y'know, that's D.C.!\"\n->\"Glad to hear you're enjoying it!\"\n    Ruby: \"Yeah, thanks! It's been really cool, just... far away.\"\n    Ruby: \"Y'know. From everybody.\"\n    Lance nods.\n    Lance: \"Yeah, I feel. It's really good to see you all again.\"\n    Allison: \"Yeah, for sure, Ruby, but what you're doing is important to you.\"\n    Allison: \"Besides, you and Franklin are still making the long-distance thing work, right?\"\n    Ruby: \"Oh, well... we're... um...\n    [[AwkwardFranklin]]\n->\"What do they make you study?\"\n    Ruby: \"Oh boy, yeah, there's a lot of bio and chem and whatnot. Like, a ton. Which makes sense, of course.\"\n    Ruby: \"For now I'm still working through a lot of the basic required stuff. It's cool, but it's also pretty tough.\"\n    She sighed.\n    Ruby: \"Honestly, I could use a study buddy. Lance, remember when we used to do that?\"\n    Lance: \"Yeah! You saved my algebra grade!\"\n    Ruby: \"Yeah, well, you saved me from being bored to death in Senor Abalos' class back then!\"\n    ->\"How come you haven't found a study buddy?\"\n        Ruby: \"Well, um, I was getting help from... ah, nevermind.\"\n        Allison: \"From Franklin?\"\n        [[AwkwardFranklin]]\n    ->\"I hope Franklin hasn't been distracting you too much.\"\n        Ruby: \"Well, um, the thing is...uh...\"\n        [[AwkwardFranklin]]\n->\"How've you and Franklin been doing?\"\n    Ruby: \"Oh, we're... um, well, we're...uh...\"\n    [[AwkwardFranklin]]",
		"position": {
			"x": 1714,
			"y": 198
		},
		"colorID": 0
	},
	{
		"title": "AwkwardFranklin",
		"tags": "Old_Draft",
		"body": "She turned hesitantly to Franklin.\nFranklin, ever the phantom of the room, suddenly seemed very present.\nFranklin: \"Um...\"\nFranklin: \"We broke up.\"\nAllison: \"Oh. Okay, gotcha.\"\n->\"Sorry, we didn't know.\"\n    Allison: \"Yeah. Our mistake.\"\n    Lance: \"I'm sorry to hear that.\"\n    Franklin: \"Yeah, well... Things didn't really work out.\"\n    He just left it there.\n    Lance: \"Are you guys okay?\"\n    Ruby piped up.\n    Ruby: \"Well, it was a little sudden...\"\n    Then, Franklin cut in again.\n    Franklin: \"Right, but it made sense. We both had school, and I'm working alot.\"\n    Allison: \"Oh boy, still?\"\n->\"Is everything okay?\"\n",
		"position": {
			"x": 1428,
			"y": 400
		},
		"colorID": 0
	},
	{
		"title": "SecondDiscussion",
		"tags": "",
		"body": "<<activateNeutralPortrait Ruby>>\r\n\"Yeah, I was just asking! It's been so long since we talked.\"\r\n\"I feel like we've been out of touch for too long. It just feels weird. I've missed this, honestly.\"\r\n<<clearPortrait Ruby>>\r\n<<revealValue Ruby>>\r\nRuby always was the one to listen to everyone else's problems, to be there for them when they opened up. I hadn't realized how much she'd valued that.\r\n<<activateNeutralPortrait Allison>>\r\n\"Aww, Ruby! I’ve missed you to!\"\r\n“I’m still working towards that Music major but I’ve also decided to start minoring in Education.”\r\n”Sorry, I don’t remember if I mentioned it to you guys yet.”\r\n<<clearPortrait Allison>>\r\n<<activateNeutralPortrait Lance>>\r\n“That’s definitely news to me. Since when have you ever been interested in teaching?”\r\n<<clearPortrait Lance>>\r\n<<activateNeutralPortrait Allison>>\r\n“Never! At least, not until I until I went on that university trip to France I told you about.”\r\n“We got to meet a bunch of other students in a sort of meet-and-greet.”\r\n“One thing led to another and suddenly I had my guitar out and started impromptu teaching a few of them how to play.”\r\n“It made me realize that teaching music might actually be really fun as well, so I figured I might as well try it out, y’know?”\r\n<<clearPortrait Allison>>\r\n<<activateNeutralPortrait Ruby>>\r\n“Oh that’s so cool! But aren’t you worried about getting swamped with work?”\r\n<<clearPortrait Ruby>>\r\n<<activateNeutralPortrait Franklin>>\r\n“I’m sure she’ll be fine. Allison’s always had a solid work ethic.”\r\n<<clearPortrait Franklin>>\r\n<<activateNeutralPortrait Allison>>\r\n“Well I’ve got nothing on you, that’s for sure.” \r\n“Aren’t you working something like two jobs on top of a CompSci major?”\r\n<<clearPortrait Allison>>\r\n<<activateNeutralPortrait Ruby>>\r\n“Actually he’s working three now and barely has time to see anyone ever.” \r\n“Don’t you want to have some time for yourself and your friends?”\r\n<<clearPortrait Ruby>>\r\n<<revealValue Franklin>>\r\n<<activateNeutralPortrait Franklin>>\r\n“You can always find time for stuff like that in your schedule. But you only get fleeting chances to jump on opportunities that make your schedule interesting.”\r\n<<clearPortrait Franklin>>\r\n->“He’s right, if this is something that interests you should go for it.”\r\n    <<increaseValue Franklin>>\r\n    <<decreaseValue Ruby>>\r\n    <<activateNeutralPortrait Allison>>\r\n    “Well I’ll do my best as always. But hey, Ruby, don’t worry okay?”\r\n    “I always make time for you guys, don’t I.”\r\n    <<clearPortrait Allison>>\r\n    <<activateNeutralPortrait Ruby>>\r\n    “Of course, of course I just…”\r\n    <<clearPortrait Ruby>>\r\n    <<activateNeutralPortrait Lance>>\r\n    “OH WAIT. Ty, didn’t you say earlier that you found a new party game that we just had to play?”\r\n    <<clearPortrait Lance>>\r\n    “Oh, I set that up in the living room. Do you guys want to check it out now?”\r\n    <<activateNeutralPortrait Lance>>\r\n    “Hell yes! Today’s the day I beat Franklin in a game for sure.”\r\n    <<clearPortrait Lance>>\r\n    <<activateNeutralPortrait Franklin>>\r\n    “Not even in your wildest dreams dude.”\r\n    <<clearPortrait Franklin>>\r\n    “Alright well let’s grab all this stuff and bring it in then. The game’s already set up in the living room.”\r\n    [[OneOnOneNode]]\r\n->“I don’t know. There’s a fine line between being busy and being buried Franklin.”\r\n    <<increaseValue Ruby>>\r\n    <<decreaseValue Franklin>>\r\n    He shrugs.\r\n    <<activateNeutralPortrait Franklin>>\r\n    “Agree to disagree I suppose.”\r\n    “I’ve always found it’s better to be busier.”\r\n    <<clearPortrait Franklin>>\r\n    <<activateNeutralPortrait Ruby>>\r\n    “Better? How can-”\r\n    <<clearPortrait Ruby>>\r\n    <<activateNeutralPortrait Lance>>\r\n    “OH WAIT. Ty, didn’t you say earlier that you found a new party game that we just had to play?”\r\n    <<clearPortrait Lance>>\r\n    “Oh, I set that up in the living room. Do you guys want to check it out now?”\r\n    <<activateNeutralPortrait Lance>>\r\n    “Hell yes! Today’s the day I beat Franklin in a game for sure.”\r\n    <<clearPortrait Lance>>\r\n    <<activateNeutralPortrait Franklin>>\r\n    “Not even in your wildest dreams dude.”\r\n    <<clearPortrait Franklin>>\r\n    “Alright well let’s grab all this stuff and bring it in then. The game’s already set up in the living room.”\r\n    [[OneOnOneNode]]\r\n->“Hey, let’s have some faith here! Allison can do both no problem.”\r\n    <<activateNeutralPortrait Allison>>\r\n    “Hah! I don’t know if I’ll have ‘no problem’, but there’s probably no harm in trying, right?”\r\n    <<clearPortrait Allison>>\r\n    <<activateNeutralPortrait Ruby>>\r\n    “Oh of course not! Sorry, I didn’t mean to sound like you shouldn’t try.”\r\n    ”I guess, I just-.”\r\n    <<clearPortrait Ruby>>\r\n    <<activateNeutralPortrait Lance>>\r\n    “OH WAIT. Ty, didn’t you say you found a new party game that we just had to play?”\r\n    <<clearPortrait Lance>>\r\n    “Oh, I set that up in the living room. Do you guys want to check it out now?”\r\n    <<activateNeutralPortrait Lance>>\r\n    “Hell yes! Today’s the day I beat Franklin in a game for sure.”\r\n    <<clearPortrait Lance>>\r\n    <<activateNeutralPortrait Franklin>>\r\n    “Not even in your wildest dreams dude.”\r\n    <<clearPortrait Franklin>>\r\n“Alright well let’s grab all this stuff and bring it in then. The game’s already set up in the living room.”\r\n[[OneOnOneNode]]\r\n",
		"position": {
			"x": 863,
			"y": 511
		},
		"colorID": 0
	},
	{
		"title": "LanceConvo",
		"tags": "",
		"body": "As we stepped inside, I put a hand on Lance's shoulder, discretely holding him back.\n\"Hey, Lance, are you okay?\"\n<<activateNeutralPortrait Lance>>\n\"Well, it's...\"\n<<clearPortrait Lance>>\nHe sighs.\n<<activateNeutralPortrait Lance>>\n\"I haven't been getting any gigs.\"\n\"All I have is my job at the drugstore. That's it.\"\n\"The band... that was my ticket. That's how I was going to make it big.\"\n\"And Allison... she hasn't been talking to me.\"\n\"I'm not sure if she still wants to do it. And if she doesn't, where does that leave me?\"\n<<clearPortrait Lance>>\nHe shook his head and turned back into the house. \nTO BE CONTINUED...",
		"position": {
			"x": 611,
			"y": 1115
		},
		"colorID": 0
	},
	{
		"title": "AllisonConvo",
		"tags": "",
		"body": "As we stepped inside, I put a hand on Allison's shoulder, discretely holding her back.\n\"Hey, Allison, are you okay? You seemed kind of tense with Lance.\"\n<<activateNeutralPortrait Allison>>\n\"It's... well, he's, y'know.\"\n\"Listen, Ty, I appreciate you getting us back together. This is good.\"\n\"But the fact is, I've got my own life now. There are things I just can't do here.\"\n\"But Lance has really been nagging me about that band, and, well...\"\n\"I don't want to stay in this town. What would my future be if I was stuck here in his band?\"\n<<clearPortrait Allison>>\nShe turned away and went back into the house.\nTO BE CONTINUED...",
		"position": {
			"x": 1187,
			"y": 1128
		},
		"colorID": 0
	},
	{
		"title": "OneOnOneNode",
		"tags": "",
		"body": "<<passTime ClockText>>\nAs we packed up, some people went ahead but two people are still around collecting their things. \nWho should I hang back and chat with?\n<<if $ruby_will_share_info is true>>\n[[Talk to Ruby|RubyConvo]]\n<<endif>>\n<<if $franklin_will_share_info is true>>\n[[Talk to Franklin|FranklinConvo]]\n<<endif>>\n<<if $lance_will_share_info is true>>\n[[Talk to Lance|LanceConvo]]\n<<endif>>\n<<if $allison_will_share_info is true>>\n[[Talk to Allison|AllisonConvo]]\n<<endif>>",
		"position": {
			"x": 828,
			"y": 792
		},
		"colorID": 0
	},
	{
		"title": "RubyConvo",
		"tags": "",
		"body": "As we began heading in, I hung back and waited for Ruby.\r\n“Hey, Ruby, are you okay?”\r\n<<activateNeutralPortrait Ruby>>\r\n“I...uh…”\r\n<<clearPortrait Ruby>>\r\nShe remained quiet for a moment as we walked, keeping her eyes looking down.\r\n<<activateNeutralPortrait Ruby>>\r\n“I’d wanted to tell you this before the party because...well...”\r\n<<clearPortrait Ruby>>\r\nShe stopped and I followed suit, looking back towards her.\r\n<<activateNeutralPortrait Ruby>>\r\n“Franklin broke up with me two months ago, and before you ask I have no clue why he did.”\r\n“I’m okay. At least a lot better than I was back then but...it just...it hurts? \r\n“A four relationship just...poof. Gone.”\r\n“I almost didn’t come today if I’m being honest.\" \r\n\"But I kind of hoping...that I could see him again I could find out why?\r\n<<clearPortrait Ruby>>\r\nTO BE CONTINUED...",
		"position": {
			"x": 1184,
			"y": 805
		},
		"colorID": 0
	},
	{
		"title": "FranklinConvo",
		"tags": "",
		"body": "As we began heading in, I hung back and waited for Franklin.\r\n“Hey Franklin, are you okay?”\r\n<<activateNeutralPortrait Franklin>>\r\n“Nope, not in the slightest.”\r\n“I’m working three jobs, all of which I hate, and I’m going to college for a major that doesn’t interest me at all.”\r\n“Sorry this probably wasn’t the way I should’ve told you all that but...yeah sorry.”\r\n“I dunno Ty, I just feel a bit lost. I know everything I’m doing is for me and my family’s sake but...but I feel like I’m missing out on so much.”\r\n“Like seeing you all more and...Ruby.”\r\n“I’m just not sure what to do…”\r\n<<clearPortrait Franklin>>\r\nTO BE CONTINUED...",
		"position": {
			"x": 472,
			"y": 816
		},
		"colorID": 0
	}
]